perftests/run4.log
hey -z 30s -m GET -cpus 4 -c 200 -H "Authorization: icandowhatiwant" http://localhost:9000/performance

Summary:
  Total:	30.0054 secs
  Slowest:	0.1440 secs
  Fastest:	0.0000 secs
  Average:	0.0085 secs
  Requests/sec:	23553.9010
  
  Total data:	84094206 bytes
  Size/request:	119 bytes

Response time histogram:
  0.000 [1]	|
  0.014 [576447]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.029 [115355]	|■■■■■■■■
  0.043 [13423]	|■
  0.058 [1233]	|
  0.072 [159]	|
  0.086 [36]	|
  0.101 [13]	|
  0.115 [5]	|
  0.130 [1]	|
  0.144 [1]	|


Latency distribution:
  10% in 0.0010 secs
  25% in 0.0025 secs
  50% in 0.0066 secs
  75% in 0.0122 secs
  90% in 0.0187 secs
  95% in 0.0233 secs
  99% in 0.0334 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.1440 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0042 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.0085 secs, 0.0000 secs, 0.1440 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0019 secs

Status code distribution:
  [400]	706674 responses

Error distribution:
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62741->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62743->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62744->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62745->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62746->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62747->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62748->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62749->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62750->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62751->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62752->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62753->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62754->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62755->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62756->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62757->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62758->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62759->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62760->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62761->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62762->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62763->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62764->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62765->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62766->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62767->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62768->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62769->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62770->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62771->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62772->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62773->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62774->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62775->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62776->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62777->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62778->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62779->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62780->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62781->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62782->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62783->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62784->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62785->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62786->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62787->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62788->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62789->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62790->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62791->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62792->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62793->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62794->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62795->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62796->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62797->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62798->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62799->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62800->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62801->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62802->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62803->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62804->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62805->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62806->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62807->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62808->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62809->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62810->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62811->[::1]:9000: read: connection reset by peer
  [1]	Get "http://localhost:9000/performance": read tcp [::1]:62812->[::1]:9000: read: connection reset by peer